In [49]:
# Dependencies and Setup
# SQL Alchemy
from sqlalchemy import create_engine

# Pandas
import pandas as pd

# Matplotlib
import matplotlib.pyplot as plt
%matplotlib inline

# NumPy
import numpy as np

# Contains the Postgres login information
engine = create_engine('postgresql://postgres:postgres@localhost:5432/Employee_SQL')
connect = engine.connect()

#runs a test import from table and shows head
test = pd.read_sql_query('SELECT * FROM employees', connect)
test.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [50]:
# Query All Records in the Salaries Table
salary_data = pd.read_sql("SELECT * FROM salaries", connect)
salary_data.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12

In [51]:
# Query All Records in the Titles Table
titles_data = pd.read_sql("SELECT * FROM titles", connect)
titles_data.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [52]:
#Merge columns/Combine data
combined_data = pd.merge(salary_data, titles_data, on ='emp_no', how = 'inner')
combined_data.head()

,emp_no,salary,from_date_x,to_date_x,title,from_date_y,to_date_y
0,10001,60117,1986-06-26,1987-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,65828,1996-08-03,1997-08-03,Staff,1996-08-03,9999-01-01
2,10003,40006,1995-12-03,1996-12-02,Senior Engineer,1995-12-03,9999-01-01
3,10004,40054,1986-12-01,1987-12-01,Engineer,1986-12-01,1995-12-01
4,10004,40054,1986-12-01,1987-12-01,Senior Engineer,1995-12-01,9999-01-01

In [53]:
#Groupby Title
grouped_data = combined_data.groupby('title').mean()
grouped_data.head()

                           emp_no        salary
title
Assistant Engineer  251495.398533  48493.204786
Engineer            252943.159987  48539.781423
Manager             110780.833333  51531.041667
Senior Engineer     253034.375949  48506.751806
Senior Staff        253423.367183  58503.286614

In [55]:
drop = grouped_data.drop(columns = 'emp_no')
drop

                          salary
title
Assistant Engineer  48493.204786
Engineer            48539.781423
Manager             51531.041667
Senior Engineer     48506.751806
Senior Staff        58503.286614
Staff               58465.271904
Technique Leader    48580.505772